{
  "0.9.4": {
    "date": "2026-02-23",
    "info": "Improved link rendering and interaction in table cells.",
    "new": [],
    "improved": [
      "Table cells now render inline links that can be opened directly, replacing the right-side link icon button; fixed Markdown link classification for non-ASCII internal paths."
    ],
    "fixed": [],
    "changed": []
  },
  "0.9.3": {
    "date": "2026-01-14",
    "info": "Metadata alignment for community submission.",
    "new": [],
    "improved": [],
    "fixed": [],
    "changed": []
  },
  "0.9.2": {
    "date": "2026-01-13",
    "info": "",
    "new": [
      "Add status-related CSS support"
    ],
    "improved": [],
    "fixed": [
      "Restore the view toolbar overflow menu",
      "Status column shows correctly after unhide",
      "Empty notes can be converted directly to the default table"
    ],
    "changed": []
  },
  "0.9.1": {
    "date": "2026-01-13",
    "info": "Backup restore workflow, tooltip polish, and NN compatibility improvements.",
    "new": [
      "Backup restore list now includes richer entries for recovery actions.",
      "Added pre-review checks and settings quick links to speed up QA and navigation."
    ],
    "improved": [
      "Notebook Navigator compatibility: sync focus on table activation and remove pinned-view warning.",
      "Overflow tooltips now render Markdown for richer previews.",
      "View toolbar tooltips are unified for consistency."
    ],
    "fixed": [
      "Quick filter keydown no longer steals focus in grid.",
      "Tooltips now hide on tab switch and avoid flicker/blank spacing.",
      "Ctrl+C copy behavior is corrected in the grid."
    ],
    "changed": []
  },
  "0.9.0": {
    "date": "2025-12-17",
    "info": "Major update: Gallery View (Beta), Multiline Editing, and Theme Fixes.",
    "new": [
      "**Gallery View (Beta)**: Experience a brand new card-based browsing mode. Features include **16:9 Covers**, **View Groups** toolbar for organizing content, and **Right-click quick actions** to change status without opening details."
    ],
    "improved": [
      "**Table Multiline Support**: Cells now fully support multiline text display and editing. Added **keyboard-first workflows**: press `F2` to toggle edit mode and `Shift+Enter` to insert newlines.",
      "**Conversion Assistant**: Redesigned the validation flow with refined processing logic, making header conversion smarter and more reliable."
    ],
    "fixed": [
      "**Theme Compatibility**: Fixed an issue causing unreadable hover text when using the **Minimal** theme (or other themes with opaque backgrounds).",
      "**Theme Switching**: Fixed table colors not reloading correctly when switching between Light and Dark modes.",
      "Fixed slide template image detection accuracy and various UI alignment issues."
    ]
  },
  "0.8.3": {
    "date": "2025-12-07",
    "info": "",
    "new": [],
    "improved": [],
    "fixed": [
      "YAML frontmatter is now preserved when TileLineBase updates the note.",
      "YAML frontmatter is now preserved when running the conversion assistant.",
      "Slide titles no longer overlap while editing."
    ],
    "changed": []
  },
  "0.8.2": {
    "date": "2025-12-06",
    "info": "",
    "new": [
      "Kanban view now supports adding, editing, and deleting cards; double-click a card to open the edit/delete modal."
    ],
    "improved": [],
    "fixed": [
      "Slide view editing now persists correctly and no longer gets stuck when navigating.",
      "Kanban cards now default to sorting by statusChanged in descending order."
    ],
    "changed": []
  },
  "0.8.1": {
    "date": "2025-12-05",
    "info": "",
    "new": [
      "Slide cover mode for fullscreen/first-page layouts."
    ],
    "improved": [
      "More reliable H2 detection for table view parsing."
    ],
    "fixed": [
      "Default slide templates now load correctly."
    ],
    "changed": []
  },
  "0.8.0": {
    "date": "2025-12-05",
    "info": "Initial beta release.",
    "new": [],
    "improved": [],
    "fixed": [],
    "changed": []
  }
}
